IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	ble_dis_init(&dis_cfg);
}

// --- Stack Init ---


__attribute__((weak)) void SoftdeviceFaultHandler(uint32_t id, uint32_t pc, uint32_t info)
{
	DEBUG_PRINTF("SoftDevice fault! ID %#x, PC %#x, Info %#x", id, pc, info);

	switch (id) {
	case NRF_FAULT_ID_SD_ASSERT:
		DEBUG_PRINTF("NRF_FAULT_ID_SD_ASSERT: SoftDevice assert");
		break;
	case NRF_FAULT_ID_APP_MEMACC:
		DEBUG_PRINTF("NRF_FAULT_ID_APP_MEMACC: Application bad memory access");
		if (info == 0x00) {
			DEBUG_PRINTF("Application tried to access SoftDevice RAM");
		} else {
			DEBUG_PRINTF("Application tried to access SoftDevice peripheral at %#x", info);
		}
		break;
	}

	for (;;) {
		/* loop */
	}
}

/* Extern in nrf_sdh.c (called directly at enable time for scheduler model) */
void SDBleRandSeed(uint32_t evt, void *ctx)
{
	uint32_t nrf_err;
	uint8_t seed[SD_RAND_SEED_SIZE];

	(void)ctx;

	if (evt == NRF_EVT_RAND_SEED_REQUEST)
	{
		if (nrfx_cracen_entropy_get(seed, sizeof(seed)) != 0)
		{
			return;
		}

		nrf_err = sd_rand_seed_set(seed);
		(void)nrf_err;
	}
}

static uint32_t SDBleDefaultCfgSet(const BtAppCfg_t *pCfg, uint32_t ConnCfgTag, uint32_t RamStart)
{
	uint32_t err = 0;
	ble_cfg_t ble_cfg;

	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.conn_cfg.conn_cfg_tag = ConnCfgTag;
	ble_cfg.conn_cfg.params.gap_conn_cfg.conn_count = pCfg->PeriLinkCount + pCfg->CentLinkCount; //CONFIG_NRF_SDH_BLE_TOTAL_LINK_COUNT;
	ble_cfg.conn_cfg.params.gap_conn_cfg.event_length = CONFIG_NRF_SDH_BLE_GAP_EVENT_LENGTH;

	err = sd_ble_cfg_set(BLE_CONN_CFG_GAP, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_CONN_CFG_GAP, nrf_error %#x", err);

		return err;
	}

	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.gap_cfg.role_count_cfg.periph_role_count = pCfg->PeriLinkCount;

	// TODO: make this configurable
	ble_cfg.gap_cfg.role_count_cfg.adv_set_count = BLE_GAP_ADV_SET_COUNT_DEFAULT;

	ble_cfg.gap_cfg.role_count_cfg.central_role_count = pCfg->CentLinkCount;
	ble_cfg.gap_cfg.role_count_cfg.central_sec_count =
		MIN(pCfg->CentLinkCount, BLE_GAP_ROLE_COUNT_CENTRAL_SEC_DEFAULT);

	err = sd_ble_cfg_set(BLE_GAP_CFG_ROLE_COUNT, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_GAP_CFG_ROLE_COUNT, nrf_error %#x", err);

		return err;
	}

	// Max MTU
	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.conn_cfg.conn_cfg_tag = ConnCfgTag;
	ble_cfg.conn_cfg.params.gatt_conn_cfg.att_mtu = pCfg->MaxMtu > 0 ? pCfg->MaxMtu : CONFIG_NRF_SDH_BLE_GATT_MAX_MTU_SIZE;

	err = sd_ble_cfg_set(BLE_CONN_CFG_GATT, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_CONN_CFG_GATT, nrf_error %#x", err);

		return err;
	}

	// Custom UUID
	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.common_cfg.vs_uuid_cfg.vs_uuid_count = 2;//CONFIG_NRF_SDH_BLE_VS_UUID_COUNT;

	err = sd_ble_cfg_set(BLE_COMMON_CFG_VS_UUID, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_COMMON_CFG_VS_UUID, nrf_error %#x", err);

		return err;
	}

	// Configure the GATTS attribute table.
	memset(&ble_cfg, 0, sizeof(ble_cfg));
	ble_cfg.gatts_cfg.attr_tab_size.attr_tab_size = CONFIG_NRF_SDH_BLE_GATTS_ATTR_TAB_SIZE;

	err = sd_ble_cfg_set(BLE_GATTS_CFG_ATTR_TAB_SIZE, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_GATTS_CFG_ATTR_TAB_SIZE, nrf_error %#x", err);

		return err;
	}

	// Configure Service Changed characteristic.
	memset(&ble_cfg, 0x00, sizeof(ble_cfg));
	ble_cfg.gatts_cfg.service_changed.service_changed =
		IS_ENABLED(CONFIG_NRF_SDH_BLE_SERVICE_CHANGED);

	err = sd_ble_cfg_set(BLE_GATTS_CFG_SERVICE_CHANGED, &ble_cfg, RamStart);
	if (err)
	{
		DEBUG_PRINTF("Failed to set BLE_GATTS_CFG_SERVICE_CHANGED, nrf_error %#x", err);

		return err;
	}


	return err;
}

/**
 * @brief Initialize the SoftDevice BLE stack.
 *
 * In the bm framework, nrf_sdh.c handles the clock configuration
 * automatically from g_McuOsc, and nrf_sdh_ble.c handles the BLE
 * configuration from CONFIG_ defaults.  This function just
 * requests SD enable and then enables the BLE stack.
 */
bool BtAppStackInit(const BtAppCfg_t *pCfg)
{
	uint32_t err;

	DEBUG_PRINTF("BtAppStackInit: nrf_sdh_enable_request\r\n");

	uint32_t ramstart = (uint32_t)SystemRamStart();

	memset((void *)0x20000000, 0, ramstart - 0x20000000);

	// GRTC3 must be enabled with interrupt disbled before calling nrf_sdh_enable_request
	s_BtAppSdGrtc3.Init(s_BtAppSdTimerCfg);

	// Enable SoftDevice
	err = nrf_sdh_enable_request();
	if (err && err != -EALREADY)
	{
		DEBUG_PRINTF("nrf_sdh_enable_request failed: %d\r\n", err);
		return false;
	}

	err = SDBleDefaultCfgSet(pCfg, BTAPP_CONN_CFG_TAG, ramstart);

	if (err != NRF_SUCCESS)
	{
		return false;
	}

	// Require before call to nrf_sdh_ble_enable
	SDBleRandSeed(NRF_EVT_RAND_SEED_REQUEST, NULL);

	DEBUG_PRINTF("BtAppStackInit: nrf_sdh_ble_enable\r\n");

	uint32_t ramreq = ramstart;

	err = sd_ble_enable(&ramreq);

	if (ramreq > ramstart)
	{
		DEBUG_PRINTF("%x - Insufficient RAM allocated for the SoftDevice need %x", err, ramreq);
	}

	(void)sdh_state_evt_observer_notify(NRF_SDH_STATE_EVT_BLE_ENABLED);

	// Enable BLE stack (cfg_set from CONFIG_ defaults, handled in nrf_sdh_ble.c)
	//err = nrf_sdh_ble_enable(BTAPP_CONN_CFG_TAG);
	//if (err)
	//{
//		DEBUG_PRINTF("nrf_sdh_ble_enable failed: %d\r\n", err);
//		return false;
//	}

	// Initialize connection state tracking
	//ble_conn_state_init();

	return true;
}

// ---------------------------------------------------------------------------
// Secure Connections: peer_manager + nrf_ble_lesc, mirroring the nRF52
// SoftDevice port. The S145 SoftDevice owns the SMP state machine; peer_manager
// drives it and persists bonds (through the IOsonata bt_pds store), and
// nrf_ble_lesc performs the LESC ECDH. The application observes link security
// through these peer_manager events; no key material is surfaced to the app on
// this path (peer_manager is the source of truth), matching nRF52.
// ---------------------------------------------------------------------------

#define BT_APP_SEC_PARAM_MIN_KEY_SIZE	7
#define BT_APP_SEC_PARAM_MAX_KEY_SIZE	16

static void BtAppPmEvtHandler(const struct pm_evt *p_evt)
{
	// Standard peer_manager housekeeping: applies the event to internal state,
	// disconnects on security failure, and cleans flash on data update.
	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
		case PM_EVT_CONN_SEC_SUCCEEDED:
			// Link is encrypted. peer_manager holds the bond. Notify the app so
			// it can run work that needs an encrypted link (e.g. a central
			// reading protected characteristics). (nRF52 optionally enforces
			// MITM here; left permissive.)
			BtAppEvtSecured(p_evt->conn_handle);
			break;

		case PM_EVT_CONN_SEC_FAILED:
			// Security setup failed. pm_handler_disconnect_on_sec_failure above
			// already tears the link down when required.
			break;

		case PM_EVT_CONN_SEC_CONFIG_REQ:
		{
			// Allow an already-bonded peer to re-pair.
			struct pm_conn_sec_config cfg = { .allow_repairing = true };
			pm_conn_sec_config_reply(p_evt->conn_handle, &cfg);
		}
			break;

