IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// Register connection parameters event handler
	ble_conn_params_evt_handler_set(on_conn_params_evt);

	// Initialize user services
	DEBUG_PRINTF("BtAppInit: Role=0x%x PERIPHERAL=%d\r\n",
		pCfg->Role, (pCfg->Role & BTAPP_ROLE_PERIPHERAL) ? 1 : 0);
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		DEBUG_PRINTF("BtAppInit: calling BtAppInitUserServices\r\n");
		BtAppInitUserServices();
	}

	// Initialize Device Information Service
	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit(pCfg);
	}

	// Initialize user data
	BtAppInitUserData();

	g_BtAppData.AppDevice.bSecure = pCfg->SecType != BTGAP_SECTYPE_NONE;

	// Initialize Secure Connections (peer_manager + LESC) when the app
	// requests security. Bonds persist through the IOsonata bt_pds store.
	if (g_BtAppData.AppDevice.bSecure)
	{
		// No erase-bond flag in BtAppCfg_t; bonds are preserved across init.
		// A dedicated clear (pm_peers_delete / BtSmpBondClearAll) can be added
		// as a separate API if forced re-bonding is needed.
		if (BtAppPeerMngrInit(pCfg->SecType, pCfg->SecExchg, false) != NRF_SUCCESS)
		{
			DEBUG_PRINTF("BtAppPeerMngrInit failed\r\n");
			return false;
		}
	}

	// Initialize advertising
	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		if (BtAppAdvInit(pCfg) == false)
		{
			DEBUG_PRINTF("BtAppAdvInit failed\r\n");
			return false;
		}

		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_ADV,
			g_BtAppData.AdvHdl,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}
	else
	{
		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_SCAN_INIT,
			0,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}

	g_BtAppData.State = BTAPP_STATE_INITIALIZED;

	DEBUG_PRINTF("BtAppInit: success\r\n");

	return true;
}

/**
 * @brief Main BLE application run loop.
 *
 * Starts advertising (if peripheral/broadcaster) then enters the
 * main event loop.  SoftDevice events are dispatched through the
 * observer infrastructure triggered by the SD_EVT interrupt.
 */
void BtAppRun()
{
	if (g_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		BtAdvStart();
	}

	DEBUG_PRINTF("BtAppRun: entering main loop\r\n");

	while (1)
	{
		// Process any pending LESC DHKey computation. Required for LE Secure
		// Connections: nrf_ble_lesc defers the ECDH to be run from the main
		// loop rather than the BLE event context.
		if (g_BtAppData.AppDevice.bSecure)
		{
			(void)nrf_ble_lesc_request_handler();
		}

		AppEvtHandlerExec();
		BtAppEvtWait();
	}
}

// Port-level weak default for BtAppEvtWait. Bare-metal apps use __WFE.
// RTOS apps override with sem take in their bridge code.
__attribute__((weak)) void BtAppEvtWait(void)
{
	__WFE();
}

// Drains queued SoftDevice stack events by running the registered observers.
// Effect: pending stack events are delivered to their handlers. Precondition:
// SoftDevice enabled. Called from an RTOS BtAppEvtWait override after the
// waiter unblocks, so observers run in task context. Returns void.
void BtAppEvtDispatch()
{
	nrf_sdh_evts_poll();
}

static void soc_evt_poll(void *context)
{
	uint32_t nrf_err;
	uint32_t evt_id;

	DEBUG_PRINTF("soc_evt_poll\r\n");
	while (true) {
		nrf_err = sd_evt_get(&evt_id);
		if (nrf_err) {
			break;
		}

		/* Forward the event to SoC observers. */
		TYPE_SECTION_FOREACH(
			struct nrf_sdh_soc_evt_observer, nrf_sdh_soc_evt_observers, obs) {
			obs->handler(evt_id, obs->context);
		}
	}

	__ASSERT(nrf_err == NRF_ERROR_NOT_FOUND,
		 "Failed to receive SoftDevice SoC event, nrf_error %#x", nrf_err);
}

/*
 * BLE event pumping is handled by the SDK nrf_sdh_ble.c ble_evt_poll, which is
 * registered as NRF_SDH_STACK_EVT_OBSERVER(ble_evt_obs, ...). That function
 * maintains the connection-handle index table (idx_assign on CONNECTED,
 * idx_unassign on DISCONNECTED) that nrf_sdh_ble_idx_get / peer_manager
 * conn_state rely on, then fans the event out to all NRF_SDH_BLE_OBSERVERs.
 * IOsonata's own GAP/GATT handling is one such observer (ble_evt_dispatch,
 * registered below). A second pump here would also drain sd_ble_evt_get and
 * fan out without the idx tracking, leaving nrf_sdh_ble_idx_get returning -1,
 * so it is intentionally not defined.
 */

/* Auto-handle seed requests as a SoC event observer */
NRF_SDH_SOC_OBSERVER(rand_seed, SDBleRandSeed, NULL, HIGH);
/* SoftDevice SoC event pump (BLE pump is the SDK nrf_sdh_ble.c one) */
NRF_SDH_STACK_EVT_OBSERVER(soc_evt_obs, soc_evt_poll, NULL, HIGHEST);
/* IOsonata GAP/GATT handling, driven by the SDK BLE event fan-out */
NRF_SDH_BLE_OBSERVER(s_BtAppBleObserver, ble_evt_dispatch, NULL, USER);



// =====================================================================
// Central / Observer role
// ---------------------------------------------------------------------
// BtAppScanInit programs the scan parameters and arms the first scan.
// BtAppScan continues an in-flight scan (after each ADV_REPORT) or
// starts a fresh one if scanning was idle.
// BtAppScanStop halts scanning.
// BtAppConnect issues a GAP connect request using the parameters that
// were set up by the most recent BtAppScanInit call.
// =====================================================================


bool BtAppConnect(BtGapPeerAddr_t * const pPeerAddr, BtGapConnParams_t * const pConnParam)
{
	// SD requires scanning to be stopped before issuing a connect.
	g_BtAppData.bScan = false;

	return BtGapConnect(pPeerAddr, pConnParam);
}

// =====================================================================
// Central GATT client discovery (S145 SoftDevice path)
// ---------------------------------------------------------------------
// S145 owns the host. There is no BtHciDevice_t, so the ATT engine in
// bt_attreq.cpp / bt_attrsp.cpp does not apply here. Discovery runs on
// sd_ble_gattc_*_discover and the matching BLE_GATTC_EVT_* responses.
//
// Sequence: all primary services, then characteristics per service, then
// descriptors per characteristic to resolve the CCCD handle. On completion
// BtDeviceDiscovered(pDev) is called (weak default in bt_app.cpp, overridden
// by the app).
//
// Single active discovery at a time. The cursor lives in file-scope statics,
// not per peer, so concurrent central links are not supported yet. Per-link
// discovery would move this cursor into pDev->Discovery.
// =====================================================================

