IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
static void BtAppDiscDescRsp(const ble_gattc_evt_t *pEvt)
{
	BtDevice_t *pDev = s_pDiscDev;
	if (pDev == NULL)
	{
		return;
	}

	if (pEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
	{
		const ble_gattc_evt_desc_disc_rsp_t *p = &pEvt->params.desc_disc_rsp;
		BtGattDBSrvc_t *pSrvc = &pDev->Services[s_DiscSrvIdx];
		BtGattDBChar_t *pCh   = &pSrvc->characteristics[s_DiscCharIdx];

		for (uint16_t i = 0; i < p->count; i++)
		{
			switch (p->descs[i].uuid.uuid)
			{
				case BT_UUID_DESCRIPTOR_CLIENT_CHARACTERISTIC_CONFIGURATION:
					pCh->cccd_handle = p->descs[i].handle;
					break;
				case BT_UUID_DESCRIPTOR_CHARACTERISTIC_EXTENDED_PROPERTIES:
					pCh->ext_prop_handle = p->descs[i].handle;
					break;
				case BT_UUID_DESCRIPTOR_CHARACTERISTIC_USER_DESCRIPTION:
					pCh->user_desc_handle = p->descs[i].handle;
					break;
				case BT_UUID_DESCRIPTOR_REPORT_REFERENCE:
					pCh->report_ref_handle = p->descs[i].handle;
					break;
				default:
					break;
			}
		}
	}

	// Advance to the next characteristic regardless of result.
	s_DiscCharIdx++;
	BtAppDiscStartDesc(pDev);
}

bool BtAppWrite(uint16_t ConnHandle, uint16_t CharHandle, uint8_t *pData, uint16_t DataLen)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID ||
	    CharHandle == BLE_CONN_HANDLE_INVALID ||
	    pData == nullptr || DataLen == 0)
	{
		return false;
	}

	ble_gattc_write_params_t const write_params = {
		.write_op = BLE_GATT_OP_WRITE_CMD,
		.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
		.handle   = CharHandle,
		.offset   = 0,
		.len      = DataLen,
		.p_value  = pData,
	};

	return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}

bool BtAppEnableNotify(uint16_t ConnHandle, uint16_t CccdHandle)
{
	if (ConnHandle == BLE_CONN_HANDLE_INVALID ||
	    CccdHandle == BLE_CONN_HANDLE_INVALID)
	{
		return false;
	}

	// CCCD = 16-bit little endian, bit 0 = notify, bit 1 = indicate.
	// CCCD value length is fixed at 2 bytes by the Bluetooth GATT spec.
	uint8_t buf[2] = { BLE_GATT_HVX_NOTIFICATION, 0 };

	ble_gattc_write_params_t const write_params = {
		.write_op = BLE_GATT_OP_WRITE_REQ,    // CCCD writes are write-with-response per spec
		.flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
		.handle   = CccdHandle,
		.offset   = 0,
		.len      = sizeof(buf),
		.p_value  = buf,
	};

	return sd_ble_gattc_write(ConnHandle, &write_params) == NRF_SUCCESS;
}


